garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F26Q43.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="18xxxx" edc:clonedfrom="PIC18F27Q43" edc:desc="" edc:dosid="03742" edc:dsid="DS40002171" edc:hasfreeze="true" edc:informedby="DS DOS PS" edc:masksetid="KV006" edc:name="PIC18F26Q43" edc:procid="0xA2FD" edc:psid="DS40002079" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power edc:hashighvoltagemclr="true" edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="9.000" edc:maxvoltage="9.000" edc:minvoltage="7.900"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="2.100" edc:minvoltage="1.800" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasepagesize="128" edc:haschecksum="false" edc:haslvp="true" edc:haslvp2="true" edc:hasrowerasecmd="true" edc:hasvppfirst="true" edc:lvpthresh="2.100" edc:memtech="ee" edc:pagesize="128" edc:panelsize="0x0" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="75" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="75" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="eedata" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="75" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="rowerase" edc:time="11000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="128" edc:progop="rowerase"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="userid"/>
    <edc:Wait edc:lverase="11000" edc:lvpgm="75" edc:erase="11000" edc:pgm="75" edc:cfg="11000" edc:eedata="11000" edc:userid="75" edc:rowerase="11000"/>
    <edc:Latches edc:rowerase="128" edc:pgm="1" edc:cfg="1" edc:eedata="1" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="64" edc:hwstackdepth="127">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0x000000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="cpu_pic18f_v6"/>
  <edc:Oscillator/>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="SWINT" edc:desc="Software Interrupt" edc:irq="0"/>
    <edc:Interrupt edc:cname="HLVD" edc:desc="HLVD Interrupt" edc:irq="1"/>
    <edc:Interrupt edc:cname="OSF" edc:desc="Oscillator Failure Interrupt" edc:irq="2"/>
    <edc:Interrupt edc:cname="CSW" edc:desc="Clock Switch Interrupt" edc:irq="3"/>
    <edc:Interrupt edc:cname="CLC1" edc:desc="CLC1 Interrupt" edc:irq="5"/>
    <edc:Interrupt edc:cname="IOC" edc:desc="Interrupt on change" edc:irq="7"/>
    <edc:Interrupt edc:cname="INT0" edc:desc="External Interrupt 0" edc:irq="8"/>
    <edc:Interrupt edc:cname="ZCD" edc:desc="ZCD Interrupt" edc:irq="9"/>
    <edc:Interrupt edc:cname="AD" edc:desc="ADC Interrupt" edc:irq="10"/>
    <edc:Interrupt edc:cname="ACT" edc:desc="Active Clock Tuning Interrupt" edc:irq="11"/>
    <edc:Interrupt edc:cname="CMP1" edc:desc="Comparator 1 Interrupt" edc:irq="12"/>
    <edc:Interrupt edc:cname="SMT1" edc:desc="SMT1 Interrupt" edc:irq="13"/>
    <edc:Interrupt edc:cname="SMT1PRA" edc:desc="SMT1 Period acqusition Interrupt" edc:irq="14"/>
    <edc:Interrupt edc:cname="SMT1PRW" edc:desc="SMT1 Pulse width acqusition Interrupt" edc:irq="15"/>
    <edc:Interrupt edc:cname="ADT" edc:desc="ADC Treshold Interrupt" edc:irq="16"/>
    <edc:Interrupt edc:cname="DMA1SCNT" edc:desc="DMA1 Source count Interrupt" edc:irq="20"/>
    <edc:Interrupt edc:cname="DMA1DCNT" edc:desc="DMA1 Destination count Interrupt" edc:irq="21"/>
    <edc:Interrupt edc:cname="DMA1OR" edc:desc="DMA1 Overflow Interrupt" edc:irq="22"/>
    <edc:Interrupt edc:cname="DMA1A" edc:desc="DMA1 Abort Interrupt" edc:irq="23"/>
    <edc:Interrupt edc:cname="SPI1RX" edc:desc="SPI1 Receive Interrupt" edc:irq="24"/>
    <edc:Interrupt edc:cname="SPI1TX" edc:desc="SPI1 Transmit Interrupt" edc:irq="25"/>
    <edc:Interrupt edc:cname="SPI1" edc:desc="SPI1 Interrupt" edc:irq="26"/>
    <edc:Interrupt edc:cname="TMR2" edc:desc="Timer2 Interrupt" edc:irq="27"/>
    <edc:Interrupt edc:cname="TMR1" edc:desc="Timer1 Interrupt" edc:irq="28"/>
    <edc:Interrupt edc:cname="TMR1G" edc:desc="Timer1 Gate Interrupt" edc:irq="29"/>
    <edc:Interrupt edc:cname="CCP1" edc:desc="CCP1 Interrupt" edc:irq="30"/>
    <edc:Interrupt edc:cname="TMR0" edc:desc="Timer0 Interrupt" edc:irq="31"/>
    <edc:Interrupt edc:cname="U1RX" edc:desc="UART1 Receive Interrupt" edc:irq="32"/>
    <edc:Interrupt edc:cname="U1TX" edc:desc="UART1 Transmit Interrupt" edc:irq="33"/>
    <edc:Interrupt edc:cname="U1E" edc:desc="UART1 Error Interrupt" edc:irq="34"/>
    <edc:Interrupt edc:cname="U1" edc:desc="UART1 Interrupt" edc:irq="35"/>
    <edc:Interrupt edc:cname="PWM1PR" edc:desc="PWM1 Period Interrupt" edc:irq="38"/>
    <edc:Interrupt edc:cname="PWM1" edc:desc="PWM1 Interrupt" edc:irq="39"/>
    <edc:Interrupt edc:cname="SPI2RX" edc:desc="SPI2 Receive Interrupt" edc:irq="40"/>
    <edc:Interrupt edc:cname="SPI2TX" edc:desc="SPI2 Transmit Interrupt" edc:irq="41"/>
    <edc:Interrupt edc:cname="SPI2" edc:desc="SPI2 Interrupt" edc:irq="42"/>
    <edc:Interrupt edc:cname="TMR3" edc:desc="Timer3 Interrupt" edc:irq="44"/>
    <edc:Interrupt edc:cname="TMR3G" edc:desc="Timer3 Gate Interrupt" edc:irq="45"/>
    <edc:Interrupt edc:cname="PWM2PR" edc:desc="PWM2 Period Interrupt" edc:irq="46"/>
    <edc:Interrupt edc:cname="PWM2" edc:desc="PWM2 Interrupt" edc:irq="47"/>
    <edc:Interrupt edc:cname="INT1" edc:desc="External Interrupt 1" edc:irq="48"/>
    <edc:Interrupt edc:cname="CLC2" edc:desc="CLC2 Interrupt" edc:irq="49"/>
    <edc:Interrupt edc:cname="CWG1" edc:desc="CWG1 Interrupt" edc:irq="50"/>
    <edc:Interrupt edc:cname="NCO1" edc:desc="NCO1 Interrupt" edc:irq="51"/>
    <edc:Interrupt edc:cname="DMA2SCNT" edc:desc="DMA2 Source count Interrupt" edc:irq="52"/>
    <edc:Interrupt edc:cname="DMA2DCNT" edc:desc="DMA2 Destination count Interrupt" edc:irq="53"/>
    <edc:Interrupt edc:cname="DMA2OR" edc:desc="DMA2 Overflow Interrupt" edc:irq="54"/>
    <edc:Interrupt edc:cname="DMA2A" edc:desc="DMA2 Abort Interrupt" edc:irq="55"/>
    <edc:Interrupt edc:cname="I2C1RX" edc:desc="I2C1 Receive Interrupt" edc:irq="56"/>
    <edc:Interrupt edc:cname="I2C1TX" edc:desc="I2C1 Transmit Interrupt" edc:irq="57"/>
    <edc:Interrupt edc:cname="I2C1" edc:desc="I2C1 Interrupt" edc:irq="58"/>
    <edc:Interrupt edc:cname="I2C1E" edc:desc="I2C1 Error Interrupt" edc:irq="59"/>
    <edc:Interrupt edc:cname="CLC3" edc:desc="CLC3 Interrupt" edc:irq="61"/>
    <edc:Interrupt edc:cname="PWM3PR" edc:desc="PWM3 Period Interrupt" edc:irq="62"/>
    <edc:Interrupt edc:cname="PWM3" edc:desc="PWM3 Interrupt" edc:irq="63"/>
    <edc:Interrupt edc:cname="U2RX" edc:desc="UART2 Receive Interrupt" edc:irq="64"/>
    <edc:Interrupt edc:cname="U2TX" edc:desc="UART2 Transmit Interrupt" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2E" edc:desc="UART2 Error Interrupt" edc:irq="66"/>
    <edc:Interrupt edc:cname="U2" edc:desc="UART2 Interrupt" edc:irq="67"/>
    <edc:Interrupt edc:cname="TMR5" edc:desc="Timer5 Interrupt" edc:irq="68"/>
    <edc:Interrupt edc:cname="TMR5G" edc:desc="Timer5 Gate Interrupt" edc:irq="69"/>
    <edc:Interrupt edc:cname="CCP2" edc:desc="CCP2 Interrupt" edc:irq="70"/>
    <edc:Interrupt edc:cname="SCAN" edc:desc="Scanner Interrupt" edc:irq="71"/>
    <edc:Interrupt edc:cname="U3RX" edc:desc="UART3 Receive Interrupt" edc:irq="72"/>
    <edc:Interrupt edc:cname="U3TX" edc:desc="UART3 Transmit Interrupt" edc:irq="73"/>
    <edc:Interrupt edc:cname="U3E" edc:desc="UART3 Error Interrupt" edc:irq="74"/>
    <edc:Interrupt edc:cname="U3" edc:desc="UART3 Interrupt" edc:irq="75"/>
    <edc:Interrupt edc:cname="CLC4" edc:desc="CLC4 Interrupt" edc:irq="77"/>
    <edc:Interrupt edc:cname="INT2" edc:desc="External Interrupt 2" edc:irq="80"/>
    <edc:Interrupt edc:cname="CLC5" edc:desc="CLC5 Interrupt" edc:irq="81"/>
    <edc:Interrupt edc:cname="CWG2" edc:desc="CWG2 Interrupt" edc:irq="82"/>
    <edc:Interrupt edc:cname="NCO2" edc:desc="NCO2 Interrupt" edc:irq="83"/>
    <edc:Interrupt edc:cname="DMA3SCNT" edc:desc="DMA3 Source count Interrupt" edc:irq="84"/>
    <edc:Interrupt edc:cname="DMA3DCNT" edc:desc="DMA3 Destination count Interrupt" edc:irq="85"/>
    <edc:Interrupt edc:cname="DMA3OR" edc:desc="DMA3 Overflow Interrupt" edc:irq="86"/>
    <edc:Interrupt edc:cname="DMA3A" edc:desc="DMA3 Abort Interrupt" edc:irq="87"/>
    <edc:Interrupt edc:cname="CCP3" edc:desc="CCP3 Interrupt" edc:irq="88"/>
    <edc:Interrupt edc:cname="CLC6" edc:desc="CLC6 Interrupt" edc:irq="89"/>
    <edc:Interrupt edc:cname="CWG3" edc:desc="CWG3 Interrupt" edc:irq="90"/>
    <edc:Interrupt edc:cname="TMR4" edc:desc="Timer4 Interrupt" edc:irq="91"/>
    <edc:Interrupt edc:cname="DMA4SCNT" edc:desc="DMA4 Source count Interrupt" edc:irq="92"/>
    <edc:Interrupt edc:cname="DMA4DCNT" edc:desc="DMA4 Destination count Interrupt" edc:irq="93"/>
    <edc:Interrupt edc:cname="DMA4OR" edc:desc="DMA4 Overflow Interrupt" edc:irq="94"/>
    <edc:Interrupt edc:cname="DMA4A" edc:desc="DMA4 Abort Interrupt" edc:irq="95"/>
    <edc:Interrupt edc:cname="U4RX" edc:desc="UART4 Receive Interrupt" edc:irq="96"/>
    <edc:Interrupt edc:cname="U4TX" edc:desc="UART4 Transmit Interrupt" edc:irq="97"/>
    <edc:Interrupt edc:cname="U4E" edc:desc="UART4 Error Interrupt" edc:irq="98"/>
    <edc:Interrupt edc:cname="U4" edc:desc="UART4 Interrupt" edc:irq="99"/>
    <edc:Interrupt edc:cname="DMA5SCNT" edc:desc="DMA5 Source count Interrupt" edc:irq="100"/>
    <edc:Interrupt edc:cname="DMA5DCNT" edc:desc="DMA5 Destination count Interrupt" edc:irq="101"/>
    <edc:Interrupt edc:cname="DMA5OR" edc:desc="DMA5 Overflow Interrupt" edc:irq="102"/>
    <edc:Interrupt edc:cname="DMA5A" edc:desc="DMA5 Abort Interrupt" edc:irq="103"/>
    <edc:Interrupt edc:cname="U5RX" edc:desc="UART5 Receive Interrupt" edc:irq="104"/>
    <edc:Interrupt edc:cname="U5TX" edc:desc="UART5 Transmit Interrupt" edc:irq="105"/>
    <edc:Interrupt edc:cname="U5E" edc:desc="UART5 Error Interrupt" edc:irq="106"/>
    <edc:Interrupt edc:cname="U5" edc:desc="UART5 Interrupt" edc:irq="107"/>
    <edc:Interrupt edc:cname="DMA6SCNT" edc:desc="DMA6 Source count Interrupt" edc:irq="108"/>
    <edc:Interrupt edc:cname="DMA6DCNT" edc:desc="DMA6 Destination count Interrupt" edc:irq="109"/>
    <edc:Interrupt edc:cname="DMA6OR" edc:desc="DMA6 Overflow Interrupt" edc:irq="110"/>
    <edc:Interrupt edc:cname="DMA6A" edc:desc="DMA6 Abort Interrupt" edc:irq="111"/>
    <edc:Interrupt edc:cname="CLC7" edc:desc="CLC7 Interrupt" edc:irq="113"/>
    <edc:Interrupt edc:cname="CMP2" edc:desc="Comparator 2 Interrupt" edc:irq="114"/>
    <edc:Interrupt edc:cname="NCO3" edc:desc="NCO3 Interrupt" edc:irq="115"/>
    <edc:Interrupt edc:cname="NVM" edc:desc="NVM Interrupt" edc:irq="120"/>
    <edc:Interrupt edc:cname="CLC8" edc:desc="CLC8 Interrupt" edc:irq="121"/>
    <edc:Interrupt edc:cname="CRC" edc:desc="CRC Interrupt" edc:irq="122"/>
    <edc:Interrupt edc:cname="TMR6" edc:desc="Timer6 Interrupt" edc:irq="123"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x3" edc:idbyte="r"/>
  <edc:Freeze edc:addr="0x0020">
    <edc:FreezeBit edc:freezeval="1" edc:pos="6"/>
  </edc:Freeze>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x010000" edc:regionid="page"/>
    <edc:VectorArea edc:nzsize="0x52" edc:regionid="ivt"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200100" edc:regionid="testmem1"/>
    <edc:TestZone edc:beginaddr="0x240000" edc:endaddr="0x240400" edc:regionid="testmem2"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200040" edc:regionid="idlocs"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x240004" edc:endaddr="0x240008" edc:regionid="debug"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x300012" edc:regionid="config">
      <edc:DCRDef edc:access="-nnn-nnn" edc:cname="CONFIG1" edc:desc="Configuration Byte 1" edc:factorydefault="0xff" edc:impl="0x77" edc:name="CONFIG1" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x77" edc:default="0xff" edc:_addr="0x300000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FEXTOSC" edc:desc="External Oscillator Selection" edc:mask="0x7" edc:name="FEXTOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP (crystal oscillator) optimized for 32.768 kHz" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT (crystal oscillator) above 100 kHz, below 8 MHz" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS (crystal oscillator) above 8 MHz" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator not enabled" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="ECL" edc:desc="EC (external clock) below 100 kHz" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="ECM" edc:desc="EC (external clock) for 500 kHz to 8 MHz" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="ECH" edc:desc="EC (external clock) above 8 MHz" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="RSTOSC" edc:desc="Reset Oscillator Selection" edc:mask="0x7" edc:name="RSTOSC" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="HFINTOSC_64MHZ" edc:desc="HFINTOSC with HFFRQ = 64 MHz and CDIV = 1:1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="EXTOSC_4PLL" edc:desc="EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LFINTOSC" edc:desc="Low-Frequency Oscillator" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="HFINTOSC_1MHZ" edc:desc="HFINTOSC with HFFRQ = 4 MHz and CDIV = 4:1" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="EXTOSC" edc:desc="EXTOSC operating per FEXTOSC bits (device manufacturing default)" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--n-n-nn" edc:cname="CONFIG2" edc:desc="Configuration byte 2" edc:factorydefault="0xFF" edc:impl="0x2b" edc:name="CONFIG2" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x2B" edc:default="0xFF" edc:_addr="0x300001">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CLKOUTEN" edc:desc="Clock out Enable bit" edc:mask="0x1" edc:name="CLKOUTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="CLKOUT function is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="CLKOUT function is enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PR1WAY" edc:desc="PRLOCKED One-Way Set Enable bit" edc:mask="0x1" edc:name="PR1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PRLOCKED bit can be cleared and set only once" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PRLOCKED bit can be set and cleared repeatedly" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="CSWEN" edc:desc="Clock Switch Enable bit" edc:mask="0x1" edc:name="CSWEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="The NOSC and NDIV bits cannot be changed by user software" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Writing to NOSC and NDIV is allowed" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor Enable bit" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG3" edc:desc="Configuration byte 3" edc:factorydefault="0xFF" edc:impl="0xff" edc:name="CONFIG3" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFF" edc:default="0xFF" edc:_addr="0x300002">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="MCLR Enable bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="EXTMCLR" edc:desc="If LVP = 0, MCLR pin is MCLR; If LVP = 1, RE3 pin function is MCLR " edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="INTMCLR" edc:desc="If LVP = 0, MCLR pin function is port defined function; If LVP =1, RE3 pin fuction is MCLR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWRTS" edc:desc="Power-up timer selection bits" edc:mask="0x3" edc:name="PWRTS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PWRT_OFF" edc:desc="PWRT is disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PWRT_64" edc:desc="PWRT set at 64ms" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PWRT_16" edc:desc="PWRT set at 16ms" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PWRT_1" edc:desc="PWRT set at 1ms" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MVECEN" edc:desc="Multi-vector enable bit" edc:mask="0x1" edc:name="MVECEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Multi-vector enabled, Vector table used for interrupts" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Interrupt contoller does not use vector table to prioritze interrupts" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IVT1WAY" edc:desc="IVTLOCK bit One-way set enable bit" edc:mask="0x1" edc:name="IVT1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="IVTLOCKED bit can be cleared and set only once" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="IVTLOCKED bit can be cleared and set repeatedly" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPBOREN" edc:desc="Low Power BOR Enable bit" edc:mask="0x1" edc:name="LPBOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Low-Power BOR disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low-Power BOR enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="SBORDIS" edc:desc="Brown-out Reset enabled , SBOREN bit is ignored" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NOSLP" edc:desc="Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset enabled according to SBOREN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
