garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F26Q43.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x61">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0MD" edc:desc="" edc:mask="0x1" edc:name="TMR0MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5MD" edc:desc="" edc:mask="0x1" edc:name="TMR5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MD" edc:mask="0x1" edc:name="SMT1MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x62"/>
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="PMD3" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--000" edc:name="PMD3" edc:nzwidth="8" edc:por="000--000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x63">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCDMD" edc:mask="0x1" edc:name="ZCDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM1MD" edc:mask="0x1" edc:name="CM1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM2MD" edc:mask="0x1" edc:name="CM2MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ADCMD" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1MD" edc:mask="0x1" edc:name="DAC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTMD" edc:mask="0x1" edc:name="ACTMD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PMD4" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PMD4" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x64">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCO1MD" edc:mask="0x1" edc:name="NCO1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2MD" edc:mask="0x1" edc:name="NCO2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3MD" edc:mask="0x1" edc:name="NCO3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DSM1MD" edc:mask="0x1" edc:name="DSM1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MD" edc:mask="0x1" edc:name="CWG1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2MD" edc:mask="0x1" edc:name="CWG2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3MD" edc:mask="0x1" edc:name="CWG3MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="PMD5" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="PMD5" edc:nzwidth="8" edc:por="-000-000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x65">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3MD" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1MD" edc:mask="0x1" edc:name="PWM1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2MD" edc:mask="0x1" edc:name="PWM2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3MD" edc:mask="0x1" edc:name="PWM3MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x66">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1MD" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3MD" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4MD" edc:mask="0x1" edc:name="U4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5MD" edc:mask="0x1" edc:name="U5MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD7" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x67">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC1MD" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2MD" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3MD" edc:mask="0x1" edc:name="CLC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4MD" edc:mask="0x1" edc:name="CLC4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5MD" edc:mask="0x1" edc:name="CLC5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6MD" edc:mask="0x1" edc:name="CLC6MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7MD" edc:mask="0x1" edc:name="CLC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8MD" edc:mask="0x1" edc:name="CLC8MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PMD8" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PMD8" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02264-pmd-mid8-v1-KV006.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x68">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA1MD" edc:mask="0x1" edc:name="DMA1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2MD" edc:mask="0x1" edc:name="DMA2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3MD" edc:mask="0x1" edc:name="DMA3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4MD" edc:mask="0x1" edc:name="DMA4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5MD" edc:mask="0x1" edc:name="DMA5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6MD" edc:mask="0x1" edc:name="DMA6MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x69"/>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="MD1CON0" edc:desc="" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="MD1CON0" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02566_txm_mod_v3_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x6A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BIT" edc:desc="" edc:mask="0x1" edc:name="BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1BIT" edc:desc="" edc:mask="0x1" edc:name="MD1BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD1OPOL" edc:desc="" edc:mask="0x1" edc:name="MD1OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1OUT" edc:desc="" edc:mask="0x1" edc:name="MD1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD1EN" edc:desc="" edc:mask="0x1" edc:name="MD1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="MD1CON1" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="MD1CON1" edc:nzwidth="8" edc:por="--00--00" edc:_modsrc="DOS-02566_txm_mod_v3_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLSYNC" edc:desc="" edc:mask="0x1" edc:name="CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHSYNC" edc:desc="" edc:mask="0x1" edc:name="CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHPOL" edc:desc="" edc:mask="0x1" edc:name="CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1CLSYNC" edc:desc="" edc:mask="0x1" edc:name="MD1CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CLPOL" edc:desc="" edc:mask="0x1" edc:name="MD1CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MD1CHSYNC" edc:desc="" edc:mask="0x1" edc:name="MD1CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CHPOL" edc:desc="" edc:mask="0x1" edc:name="MD1CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="MD1SRC" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="MD1SRC" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02566_txm_mod_v3_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x6C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MS" edc:desc="" edc:mask="0x3f" edc:name="MS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MS0" edc:desc="" edc:mask="0x1" edc:name="MS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MS1" edc:desc="" edc:mask="0x1" edc:name="MS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MS2" edc:desc="" edc:mask="0x1" edc:name="MS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MS3" edc:desc="" edc:mask="0x1" edc:name="MS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MS4" edc:desc="" edc:mask="0x1" edc:name="MS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MS5" edc:desc="" edc:mask="0x1" edc:name="MS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1MS" edc:desc="" edc:mask="0x3f" edc:name="MD1MS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1MS0" edc:desc="" edc:mask="0x1" edc:name="MD1MS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD1MS1" edc:desc="" edc:mask="0x1" edc:name="MD1MS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD1MS2" edc:desc="" edc:mask="0x1" edc:name="MD1MS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD1MS3" edc:desc="" edc:mask="0x1" edc:name="MD1MS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD1MS4" edc:desc="" edc:mask="0x1" edc:name="MD1MS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD1MS5" edc:desc="" edc:mask="0x1" edc:name="MD1MS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
