garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F26Q43.PIC
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="I2C1PIR" edc:desc="I2C PERIPHERAL INTERRUPT FLAG REGISTER" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1PIR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x29A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCIF" edc:mask="0x1" edc:name="SCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIF" edc:mask="0x1" edc:name="RSCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIF" edc:mask="0x1" edc:name="PCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADRIF" edc:mask="0x1" edc:name="ADRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRIF" edc:mask="0x1" edc:name="WRIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKTIF" edc:mask="0x1" edc:name="ACKTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNTIF" edc:mask="0x1" edc:name="CNTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SC1IF" edc:mask="0x1" edc:name="SC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSC1IF" edc:mask="0x1" edc:name="RSC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PC1IF" edc:mask="0x1" edc:name="PC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR1IF" edc:mask="0x1" edc:name="ADR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR1IF" edc:mask="0x1" edc:name="WR1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT1IF" edc:mask="0x1" edc:name="ACKT1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT1IF" edc:mask="0x1" edc:name="CNT1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="I2C1PIE" edc:desc="I2C PERIPHERAL INTERRUPT ENABLE REGISTER" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1PIE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x29B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCIE" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIE" edc:mask="0x1" edc:name="RSCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADRIE" edc:mask="0x1" edc:name="ADRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRIE" edc:mask="0x1" edc:name="WRIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKTIE" edc:mask="0x1" edc:name="ACKTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNTIE" edc:mask="0x1" edc:name="CNTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SC1IE" edc:mask="0x1" edc:name="SC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSC1IE" edc:mask="0x1" edc:name="RSC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PC1IE" edc:mask="0x1" edc:name="PC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR1IE" edc:mask="0x1" edc:name="ADR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR1IE" edc:mask="0x1" edc:name="WR1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT1IE" edc:mask="0x1" edc:name="ACKT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT1IE" edc:mask="0x1" edc:name="CNT1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="I2C1CLK" edc:desc="I2C CLOCK SELECTION REGISTER" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="I2C1CLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x29C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2CCLK" edc:mask="0x1f" edc:name="I2CCLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CCLK0" edc:mask="0x1" edc:name="I2CCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK1" edc:mask="0x1" edc:name="I2CCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK2" edc:mask="0x1" edc:name="I2CCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK3" edc:mask="0x1" edc:name="I2CCLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK4" edc:mask="0x1" edc:name="I2CCLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I2C1BTO" edc:desc="I2C BUS TIME OUT SELECTION REGISTER" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I2C1BTO" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x29D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BTO" edc:mask="0xf" edc:name="BTO" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2CBTO" edc:mask="0xf" edc:name="I2CBTO" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="BTO0" edc:mask="0x1" edc:name="BTO0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO1" edc:mask="0x1" edc:name="BTO1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO2" edc:mask="0x1" edc:name="BTO2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO3" edc:mask="0x1" edc:name="BTO3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CBTO0" edc:mask="0x1" edc:name="I2CBTO0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTO1" edc:mask="0x1" edc:name="I2CBTO1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTO2" edc:mask="0x1" edc:name="I2CBTO2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTO3" edc:mask="0x1" edc:name="I2CBTO3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x29E"/>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="U1RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A1">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U1RXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1RXCHK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1RXCHK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2A2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXCHK" edc:desc="" edc:mask="0xff" edc:name="RXCHK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
