garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F26Q43.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADACT" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADACT" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACT" edc:desc="" edc:mask="0x3f" edc:name="ACT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACT0" edc:desc="" edc:mask="0x1" edc:name="ADACT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT1" edc:desc="" edc:mask="0x1" edc:name="ADACT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT2" edc:desc="" edc:mask="0x1" edc:name="ADACT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT3" edc:desc="" edc:mask="0x1" edc:name="ADACT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT4" edc:desc="" edc:mask="0x1" edc:name="ADACT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT5" edc:desc="" edc:mask="0x1" edc:name="ADACT5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACT" edc:mask="0x3f" edc:name="ADACT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ACT0" edc:mask="0x1" edc:name="ACT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT1" edc:mask="0x1" edc:name="ACT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT2" edc:mask="0x1" edc:name="ACT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT3" edc:mask="0x1" edc:name="ACT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT4" edc:mask="0x1" edc:name="ACT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT5" edc:mask="0x1" edc:name="ACT5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCLK" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCLK" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3FA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3f" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS3" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS4" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS5" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x3f" edc:name="ADCS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS5" edc:mask="0x1" edc:name="CS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x5" edc:_addr="0x3FB"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x4" edc:beginaddr="0x0400" edc:endaddr="0x0460" edc:regionid="sfr4">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELA" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x400">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELA0" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA1" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA2" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA3" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA4" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA5" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA6" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELA7" edc:mask="0x1" edc:name="ANSELA0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
